Revit 2027 API
Alignment.Element Property
 The underlying DirectShape element.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element Element { get; }
Public ReadOnly Property Element As Element
	Get
public:
property Element^ Element {
	Element^ get ();
}
member Element : Element with get
Property Value
Element
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace